#! /bin/bash
IMG="python"

echo "==================================================="
echo "컨테이너가 실행중이면 종료"
echo "==================================================="

OLD="$(docker ps --all --quiet --filter "name=$IMG")"
if [ -n "$OLD" ];
then
        docker rm -f $IMG
fi

echo "==================================================="
echo "도커 파일 빌드"
echo "==================================================="
docker build -t pros_and_cons .

echo "==================================================="
echo "컨테이너 실행"
echo "==================================================="
docker run -d -p 5000:5000 --name python pros_and_cons

echo "==================================================="
echo "이전 버전 이미지 삭제"
echo "==================================================="
docker rmi -f $(docker images -f "dangling=true" -q) || true